In [1]:
import pandas as pd

# Laden der Daten und Mapping auf die Stunde genau

In [10]:
df = pd.read_csv("./purchases.txt", delimiter="\t", names = ['date', 'time', 'place', 'type', 'price', 'payment_type'])

In [11]:
df['time_split'] = df.apply(lambda x: x['time'][:2], axis = 1, result_type = 'expand')

In [19]:
df.head(10)

,date,time,place,type,price,payment_type,time_split
0,2012-01-01,09:00,San Jose,Men's Clothing,214.05,Amex,09
1,2012-01-01,09:00,Fort Worth,Women's Clothing,153.57,Visa,09
2,2012-01-01,09:00,San Diego,Music,66.08,Cash,09
3,2012-01-01,09:00,Pittsburgh,Pet Supplies,493.51,Discover,09
4,2012-01-01,09:00,Omaha,Children's Clothing,235.63,MasterCard,09
5,2012-01-01,09:00,Stockton,Men's Clothing,247.18,MasterCard,09
6,2012-01-01,09:00,Austin,Cameras,379.60,Visa,09
7,2012-01-01,09:00,New York,Consumer Electronics,296.80,Cash,09
8,2012-01-01,09:00,Corpus Christi,Toys,25.38,Discover,09
9,2012-01-01,09:00,Fort Worth,Toys,213.88,Visa,09

# Berechnen diverser statistischen Werten

In [20]:
df.groupby('time_split').mean()

                 price
time_split
09          249.672185
10          250.056104
11          249.928080
12          249.855358
13          250.258298
14          249.822076
15          250.073113
16          250.243684
17          249.740575

In [21]:
 df.groupby('time_split')['price'].max()

time_split
09    499.99
10    499.99
11    499.99
12    499.99
13    499.99
14    499.99
15    499.99
16    499.99
17    499.99
Name: price, dtype: float64

In [22]:
 df.groupby('time_split')['price'].min()

time_split
09    0.0
10    0.0
11    0.0
12    0.0
13    0.0
14    0.0
15    0.0
16    0.0
17    0.0
Name: price, dtype: float64

In [23]:
 df.groupby('time_split')['price'].std()

time_split
09    144.404425
10    144.497425
11    144.269663
12    144.284005
13    144.282950
14    144.435415
15    144.145912
16    144.229889
17    144.306676
Name: price, dtype: float64

In [24]:
df[['time_split', 'price']].head(5)

  time_split   price
0         09  214.05
1         09  153.57
2         09   66.08
3         09  493.51
4         09  235.63

# Top 10 der Umsatzstärksten Filialen

In [25]:
df.groupby('place')[['place', 'price']].sum().sort_values(by='price')[:10]

                  price
place
Chandler     9919559.86
Jersey City  9920141.87
Anchorage    9933500.40
Seattle      9936267.37
San Jose     9936721.41
Oakland      9947292.52
Miami        9947316.07
New Orleans  9949257.75
Lubbock      9958119.15
Nashville    9961450.51